# จงเขียนโปรแกรม Python ของโปรแกรมคำนวณหาค่าเฉลี่ยของคะแนนจากการสอบ 3 ครั้ง โดยรับค่ารหัสนักเรียน 
# ชื่อนักเรียน และคะแนนสอบแต่ละครั้งรวม 3 ครั้งทางแป้นพิมพ์ แล้วแสดงผลค่าเฉลี่ยที่ คำนวณได้ทางหน้าจอ    (อย่างน้อย 3 ฟังก์ชั่น)
def O():
    ID = input("รหัส :")
    name = input("ชื่อนักเรียน :")
    H = int(input("สอบครั้งที่ 1 :"))
    B = int(input("สอบครั้งที่ 2 :"))
    D = int(input("สอบครั้งที่ 3 :"))
    return H, B, D

def P(H,B,D):
    Z = H+B+D / 3
    return Z


def TV(Z):
    print(f'ค่าเฉลี่ยสอบสามครั้ง = {Z}')

print("----------------------------")
print("--- ค่าเฉลี่ยคะเเนนสอบ 3 ครั้ง ---")
print("----------------------------")
H,B,D =O()
print("+++++++++++++++++++++++++++++")
Z = P(H,B,D)
TV(Z)
print("+++++++++++++++++++++++++++++")
