# จงเขียนโปรแกรม Python ตรวจสอบผลการเรียนของนักเรียน โดยป้อนจำนวนนักเรียนทีงจะตรวจสอบทาง
# แป้นพิมพ์ และในการตรวจสอบนักเรียนแต่ละคนให้ป้อน รหัสนักเรียน ชื่อนักเรียน และเกรดเฉลี่ยนักเรียน โดย
# หากเกรดเฉลี่ยไม่ถึง 2.00 ให้แสดงข้อความทางหน้าจอว่า “สอบไม่ผ่าน” หากได้เกรดเฉลี่ยตั้งแต่ 2.00 ขึ้นไปให้
# แสดงข้อความทางหน้าจอว่า “สอบผ่าน

def A():
    id = input("รหัสนักเรียน : ")
    name = input("ชื่อนักเรียน : ")
    gpa = float(input("เกรดเฉลี่ย : "))

    if gpa < 2.00:
        print(f"Student ID {id}, {name}: สอบไม่ผ่าน")
                
    else:
        print(f"Student ID {id}, {name}: สอบผ่าน")

def B(id, name, gpa):
    if gpa < 2.00:
        print(f"Student ID {id}, {name}: สอบไม่ผ่าน")
        
    else:
        print(f"Student ID {id}, {name}: สอบผ่าน")
    
print("=================================")
print("======== ตรวจสอบผลการเรียน =======")
print("=================================")
A()
print("=================================")