# จงเขียนโปรแกรม Python คำนวณหาราคาขายสินค้า โดยรับชื่อสินค้า และราคาสินค้า(ต้นทุน) ทางแป้นพิมพ์ 
# แล้วคำนวณหาราคาขายของสินค้า โดยราคาขายสินค้าจะคิดเพิ่มจากราคาสินค้า (ต้นทุน) ร้อยละ 10        (อย่างน้อย 3 ฟังก์ชั่น)

def A():
    GG = input("ซื่อสินค้า : ")
    EZ = float(input("ราคาสินค้า(ต้นทุน) :"))
    return GG, EZ

def B(EZ):
    EA = EZ + (EZ * 10 / 100)
    return EA

def C(GG, EZ , EA):
    print(f"ซื่อสินค้า :{GG:}")
    print(f"ราคาสินค้า(ต้นทุน) :{EZ:.2f} บาท")
    print(f"ราคาขายของสินค้า:{EA:.2f} บาท")

print('>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>')
print('<<<<<<Product Sale>>>>>>')
print('<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<')
GG, EZ = A()
EA = B(EZ)
C (GG, EZ, EA)
print('<<<<<<<<<<UwU>>>>>>>>>>')
