# จงเขียนโปรแกรม Python ของโปรแกรมค านวณอัตราดอกเบี้ยเงินกู้ โดยรับชื่อผู้กู้ และจำนวนเงินกู้ทางแป้นพิมพ์ 
# และแสดงผลอัตราดอกเบี้ยเงินกู้ที่คำนวณได้ทางหน้าจอ 
# ทั้งนี้อัตราดอกเบี้ยคิดจากยอดเงินกู้ หากเงินกู้ตั้งแต่ 1000 บาทขึ้นไป คิดอัตราดอกเบี้ยที่ร้อยละ 2.5 ของเงินกู้
# หากไม่ถึงคิดอัตราดอกเบี้ยที่ร้อยละ 5.5 ของเงินกู้                                              (อย่างน้อย 3 ฟังก์ชั่น)

def V(name, LA):
    if LA >= 1000:
        IR = 2.5  
    else:
        IR = 5.5  

    CI = (IR / 100) * LA

    print("ผู้กู้:", name)
    print("อัตราดอกเบี้ยที่คำนวณได้:", IR, "%")
    print("จำนวนดอกเบี้ยที่ต้องจ่าย:", CI, "บาท")

print("=================================")
print("======คำนวณอัตราดอกเบี้ยเงินกู้=======")
print("=================================")
name = input("ป้อนชื่อผู้กู้: ")
LA = float(input("ป้อนจำนวนเงินกู้ (บาท): "))
V(name, LA)
print("=================================")