#  จงเขียนโปรแกรม Python ของโปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย โดยป้อนรหัสพนักงาน ชื่อพนักงาน 
# และจำนวนเงินซึ่งเป็นยอดขายของพนักงาน จากผู้ใช้ทางแป้นพิมพ์ และคำนวณค่าคอมมิชชั่น จากเงื่อนไข ดังนี้
#  ขายของได้ไม่เกิน 1000 บาท ค่าคอมมิชชั่น เป็น 0.0 บาท
#  ขายของได้ตั้งแต่ 1001 – 2000 บาท ค่าคอมมิชชั่นคิด 1% จากยอดขาย
#  ขายของได้ตั้งแต่ 2001 – 3000 บาท ค่าคอมมิชชั่นคิด 3% จากยอดขาย
#  ขายของได้ตั้งแต่ 3001 บาท ขึ้นไป ค่าคอมมิชชั่นคิด 5% จากยอดขาย                                (อย่างน้อย 3 ฟังก์ชั่น)


def S(SO):
    if SO <= 1000:
        C = 0.0
    elif SO <= 2000:
        C = SO * 0.01
    elif SO <= 3000:
        C = SO * 0.03
    else:
        C = SO * 0.05
    
    return C

def B(id, name, C):
    print("รหัสพนักงาน :", id)
    print("ชื่อพนักงาน :", name)
    print("ยอดขาย :", SO)
    print("ค่าคอมมิชชั่น :", C)
print("=================================")
print("======= คำนวณค่าคอมมิชชั่น ========")
print("=================================")
id = input("ใส่รหัสพนักงาน : ")
name = input("ใส่ชื่อพนักงาน : ")
SO = float(input("ใส่ยอดขาย : "))

C = S(SO)
B(id, name, C)
print("=================================")