# จงเขียนโปรแกรม Python ของโปรแกรมแก้สมการ y = 2x2 + 2x + 1 เมื่อ x คือค่าที่รับทางแป้นพิมพ์และ
# แสดงผลจากการแก้สมการ y ที่ ได้ทางหน้าจอ             (อย่างน้อย 3 ฟังก์ชั่น)

def Jo():
    x = float(input("กรุณากรอกค่า x: "))
    return x

def Ja(x):
    y = 2 * x + 2 * x + 1
    return y

def Je(x, y):
    print(f"เมื่อ x = {x}, ผลลัพธ์ของ y คือ {y}")

print("----------------------------")
print("----- แก้ สมการ Y -----")
print("----------------------------")
x = Jo()
y = Ja(x)
print("----------------------------")
Je(x, y)
print("----------------------------")
